Repository: reatlat/wp-campaign-url-builder
Catalog: source/languages/campaign-url-builder-*.po
Languages: ru_ru

source: Campaign URL Builder: Existing generated links
ru_ru: Компоновщик URL Компаний: Существующие сгенерированные ссылки

source: Campaign URL Builder: Create a tracking link
ru_ru: Компоновщик URL Компаний: Создать ссылку отслеживания

source: Settings
ru_ru: Настройки

source: Donate
ru_ru: Сказать спасибо

source: Rate it
ru_ru: Оценить

source: Page to link is not a valid url. It has to start with http.
ru_ru: Страница для ссылки - не действительный URL. Он должен начинаться с http.

source: Page to link, Source, Medium or Campaign Name ar missing
ru_ru: Страница для ссылки, Источник, Канал или Название кампании отсутствуют

source: A new Campaign Link has been created successfully.
ru_ru: Новая ссылка на кампанию была успешно создана.

source: Google API key is not a valid.
ru_ru: Ключ API Google недействителен.

source: New Campaign Medium has been added
ru_ru: Добавлена новый канал кампании

source: New Campaign Source has been added
ru_ru: Добавлен новый источник кампании

source: A Campaign Medium has been removed
ru_ru: Канал кампании удален

source: A Campaign Source has been removed
ru_ru: Источник кампании удален

source: Option <strong>"Keep settings and data after delete plugin"</strong> was disabled
ru_ru: <strong>"Сохранять настройки и данные после удаления плагина"</ strong> отключен

source: Google API key has been updated.
ru_ru: Ключ API Google обновлен.

source: Can't check Google API key.
ru_ru: Невозможно проверить ключ API Google.

source: Google API key is empty now.
ru_ru: Google API ключ отсутсвует.

source: Bitly API key has been updated.
ru_ru: Обновлен Bitly API ключ.

source: Bitly API key is empty now.
ru_ru: Bitly API ключ отсутсвует.

source: Advanced setting has been updated
ru_ru: Обновлены расширенные настройки

source: Google reCaptcha API keys is empty now.
ru_ru: Ключи Google reCaptcha API теперь пусты.

source: Shortcodes setting has been updated
ru_ru: Настройки шорткодов обновлены

source: All plugin settings and data has been reset to default
ru_ru: Все настройки и данные плагина сброшены до значения по умолчанию

source: All <strong>"campaign-links"</strong> has been deleted
ru_ru: Все <strong>"ссылки кампании"</ strong> удалены.

source: All <strong>"Mediums"</strong> has been deleted
ru_ru: Все <strong>"Каналы"</ strong> удалены.

source: All <strong>"Sources"</strong> has been deleted
ru_ru: Все <strong>"Источники"</ strong> удалены.

source: All <strong>"Settings & Options"</strong> has been reset to default
ru_ru: Все <strong>"Настройки и параметры"</ strong> сброшены до значения по умолчанию.

source: Website URL
ru_ru: Ссылка на сайт

source: Campaign Source
ru_ru: Источник кампании

source: Campaign Medium
ru_ru: Канал кампании

source: Campaign Name, Product, promo code, or slogan.
ru_ru: Название кампании, продукт, промо-код или слоган.

source: Identify the paid keywords
ru_ru: поисковый запрос, связанный с этим трафиком

source: Use to differentiate ads
ru_ru: Используется для различения рекламы

source: Get a link
ru_ru: Получить ссылку

source: Click button above to get a link
ru_ru: Нажмите кнопку выше, чтобы получить ссылку

source: The link has been copied to clipboard.
ru_ru: Ссылка скопирована в буфер обмена.

source: Success
ru_ru: Успех

source: Sorry, something went wrong. Please try again.
ru_ru: Извините, что-то пошло не так. Пожалуйста, попробуйте еще раз.

source: Campaign URL Builder
ru_ru: Компоновщик URL Компаний

source: Create link
ru_ru: Создать ссылку

source: Manage links
ru_ru: Управление ссылками

source: Advanced Settings
ru_ru: Расширенные настройки

source: Shortcode
ru_ru: Шорткод

source: Knowledge base
ru_ru: База знаний

source: About
ru_ru: О плагине

source: Existing generated links
ru_ru: Существующие сгенерированные ссылки

source: Export CSV
ru_ru: Экспорт CSV

source: Notice
ru_ru: Уведомление

source: Starting March 2019, Campaign URL Builder plugin will be turning down support for goo.gl URL shortener. Previously created links will continue to redirect to their intended destination. Please see this %sblog post%s for more details.
ru_ru: Начиная с марта 2019 года плагин Campaign URL Builder прекращает поддержку сокращения ссылок с goo.gl. Ранее созданные ссылки будут продолжать перенаправлять по назначению. Пожалуйста, смотрите эту %sстатью%s для более подробной информации.

source: News
ru_ru: Новости

source: Introducing a new feature. Frontend %sshortcodes%s. More information in %sblog post%s.
ru_ru: Представляем новую функцию. Фронтенд %sшорткод%s. Больше информации в %sстатье%s.

source: The changelog, about developer, technologies cards moved to %sAbout%s tab.
ru_ru: Список изменений, посвященный разработчикам, технологиям карт, перенесен на вкладку %sО плагине%s.

source: Buy me a coffee
ru_ru: Купи мне кофе

source: Rate it to show your support!
ru_ru: Оцените плагин, чтобы показать вашу поддержку!

source: Looking for WordPress Developer?
ru_ru: Ищете разработчика WordPress?

source: Hire me to make custom integration for your WordPress project.
ru_ru: Наймите меня, чтобы сделать пользовательскую интеграцию для вашего WordPress проекта.

source: Shortcode settings
ru_ru: Настройки шорткода

source: Shortcode works only if you use your own Bitly API key or Goo.gl API Key
ru_ru: Шорткод работает, только если вы используете свой собственный ключ API Bitly или ключ API Goo.gl

source: Bitly API key
ru_ru: Bitly API ключ

source: Shortcodes status
ru_ru: Состояние шорткодов

source: Disabled
ru_ru: Отключено

source: For reason, you use default API key for Bitly or Goo.gl
ru_ru: По причине, вы используете ключ API по умолчанию для Bitly или Goo.gl

source: Front-end shortcodes (global)
ru_ru: Шорткоды (глобальные)

source: This option will enable front-end shortcodes globaly for all visitors(except anonymous).
ru_ru: Эта опция включает глобальные шорткоды для всех посетителей (кроме анонимных).

source: Enabled
ru_ru: Включено

source: Allow anonymous users
ru_ru: Разрешить анонимных пользователей

source: Any website visitor can generate a link
ru_ru: Любой посетитель сайта может создать ссылку

source: Default styles
ru_ru: Стили по умолчанию

source: Use default CSS styles for front-end shortcoes.
ru_ru: Используйте стили CSS по умолчанию для коротких ссылок.

source: Activate Google reCaptcha version 3
ru_ru: Активируйте Google reCaptcha версию 3

source: reCaptcha v3 API keys
ru_ru: reCaptcha v3 API ключ

source: (optional)
ru_ru: (необязательный)

source: if keep empty, recaptcha will be disabled
ru_ru: если оставить пустым, recaptcha будет отключен

source: Site key
ru_ru: Ключ сайта

source: Secret key
ru_ru: Секретный ключ

source: Reset API keys
ru_ru: Сбросить ключи API

source: Register your website with Google to get required API keys and enter them above.
ru_ru: Зарегистрируйте свой сайт в Google, чтобы получить необходимые ключи API и введите их выше.

source: Get the API Keys
ru_ru: Получить ключи API

source: Save Changes
ru_ru: Сохранить изменения

source: Shortcode setting available only for Administrator
ru_ru: Настройка шорткода доступна только для администратора

source: Tools
ru_ru: Утилиты

source: Shortcode generator
ru_ru: Генератор коротких кодов

source: Examples
ru_ru: Примеры

source: Simple example:
ru_ru: Простой пример:

source: Advanced example:
ru_ru: Расширенный пример:

source: PHP example:
ru_ru: PHP пример:

source: The UTM link has been created. Please check result.
ru_ru: Ссылка UTM создана. Пожалуйста, проверьте результат.

source: Advanced settings
ru_ru: Расширенные настройки

source: Show advanced settings only for Administrators
ru_ru: Показывать расширенные настройки только для администраторов

source: This option will enable advanced settings only for users with editor role Administrators
ru_ru: Этот параметр позволяет показывать дополнительные параметры только для пользователей с ролью Администратора.

source: Keep settings and data after delete the plugin
ru_ru: Сохранять настройки и данные после удаления плагина

source: Enable this option for keep plugin settings and data(links) after you delete the plugin from WP
ru_ru: Включите эту опцию для сохранения настроек плагина и данных (ссылок) после удаления плагина из ВордПресс

source: Author's column in the table of UTM Links
ru_ru: Колонка автора в таблице ссылок UTM

source: Show or hide Author's column in the table of UTM Links
ru_ru: Показать или скрыть столбец автора в таблице ссылок UTM

source: Show only own links for each user
ru_ru: Показывать только собственные ссылки для каждого пользователя

source: (except for the administrator)
ru_ru: (за исключением администратора)

source: Show only own links for each user, except for the administrator user role. Administrator can manage all links.
ru_ru: Показывать только собственные ссылки для каждого пользователя, кроме пользователей в роли администратора. Администратор может управлять всеми ссылками.

source: Show meta boxes on post/page editor
ru_ru: Показать мета-боксы в редакторе записей и страниц

source: When a user edits a post, the edit screen is composed of several default boxes: Editor, Publish, Categories, Tags, etc. These boxes are meta boxes. You can add Campaign-URL-Builder meta boxes to an edit screen of any post type.
ru_ru: Когда пользователь редактирует записи или страницы, экран редактирования состоит из нескольких полей по умолчанию: «Редактор», «Опубликовать», «Категории», «Теги» и т.д. Эти поля представляют собой мета-боксы. Вы можете добавить мета-боксы «Компоновщик URL Компаний» на экран редактирования любого типа записей.

source: URL Shortener API settings
ru_ru: Выбор сервиса для коротких ссылок

source: Bitly URL Shortener API
ru_ru: API-интерфейс сокращения ссылок Bitly

source: keep empty for use default one
ru_ru: оставить пустым для использования ключа по умолчанию

source: Paste you Bitly API key here...
ru_ru: Вставьте ключ Bitly API здесь ...

source: Reset API key
ru_ru: Сбросить ключ API

source: %sHow to get your %sBitly API key%s?%s
ru_ru: %sКак получить ключ %sBitly API%s?%s

source: Google URL Shortener API (Supported up to March 2019)
ru_ru: Google URL Shortener API (поддерживается до марта 2019 года)

source: Google API key
ru_ru: Google API ключ

source: Paste you Google API key here...
ru_ru: Вставьте ключ Google API здесь ...

source: %sHow to get your %sGoogle API key%s?%s
ru_ru: %sКак получить свой собственный %sAPI Google API%s?%s

source: Danger zone
ru_ru: Опасная зона

source: Delete all campaign-links from DataBase
ru_ru: Удалить все ссылки кампании из базы данных

source: Reset to default - Mediums
ru_ru: Сбросить настройки по умолчанию - Каналы

source: Reset to default - Sources
ru_ru: Сбросить настройки по умолчанию - Источники

source: Reset settings and options to default
ru_ru: Сбросить настройки и параметры по умолчанию

source: Reset All plugin settings and data
ru_ru: Сбросить все настройки и данные плагина

source: Reset settings & data
ru_ru: Сброс настроек и данных

source: Stats
ru_ru: Статистика

source: Campaign Name
ru_ru: Название кампании

source: Short Link
ru_ru: Короткая ссылка

source: Full Link
ru_ru: Полная ссылка

source: Creator
ru_ru: Автор

source: Open Analytics data
ru_ru: Открыть статистику

source: Example link
ru_ru: Пример ссылки

source: Click cell to copy to clipboard
ru_ru: Щелкните ячейку, чтобы скопировать в буфер обмена

source: Plugin Author
ru_ru: Автор плагина

source: Remove link
ru_ru: Удалить ссылку

source: Anonymous
ru_ru: Анонимы

source: Are you sure?
ru_ru: Ты уверен?

source: You can use this section only if the post is published
ru_ru: Вы можете использовать этот раздел, только если публикация опубликована

source: The full website URL (e.g. https://example.com/example-page/)
ru_ru: Полный URL адресс веб-сайта (например, https://example.com/example-page/)

source: The referrer: (e.g. google, newsletter)
ru_ru: Источник: (например: google, newsletter)

source: Marketing medium: (e.g. cpc, banner, email)
ru_ru: Маркетинговые каналы: (например, cpc, banner, email)

source: Product, promo code, or slogan.
ru_ru: Продукт, промо-код или слоган.

source: The Campaign Name will be formatted once submitted.
ru_ru: Название кампании будет отформатировано после отправки.

source: Campaign Term
ru_ru: Ключевое слово кампании

source: The Campaign Term will be formatted once submitted.
ru_ru: Ключевое слово кампании будет отформатирован после отправки.

source: Campaign Content
ru_ru: Содержание кампании

source: The Campaign Content will be formatted once submitted.
ru_ru: Содержимое кампании будет отформатировано после отправки.

source: Additional Parameters
ru_ru: Дополнительные параметры

source: Custom Key
ru_ru: Пользовательский ключ

source: Custom Value
ru_ru: Пользовательское значение

source: It will generate a custom pair "key" and "value".
ru_ru: Будет сгенерированы пользовательские пары «ключ» и «значение».

source: Add additional parameters
ru_ru: Добавлены дополнительные параметры

source: Generate Link
ru_ru: Создать ссылку

source: Best Practices
ru_ru: Лучшие практики

source: %sBest practices%s for creating your Campaign.
ru_ru: %sЛучшие практики%s для создания вашей кампании.

source: Frontend - Shortcodes
ru_ru: Фронтенд - Шорткоды

source: Shortcode option, works well, but still needs improvements. Read this %sarticle%s about all shortcode features.
ru_ru: Опция шорткода, работает хорошо, но все еще нуждается в улучшениях. Прочтите этой %sстатье%s обо всех функциях шорткода.

source: If you have ideas how improve it or add new features, please feel free left a %s5 star review and feedback%s.
ru_ru: Если у вас есть идеи, как улучшить его или добавить новые функции, пожалуйста, оставьте %s5 звездный отзыв%s.

source: Languages and String translation
ru_ru: Языки и перевод строк

source: Missing your language? Needs update string translations? Use %sLoco Translate%s plugin.
ru_ru: Скучаете по своему языку? Нужно обновить перевод строки? Используйте плагин %sLoco Translate%s.

source: How do I get my own Bitly OAuth access token?
ru_ru: Как получить собственный токен доступа Bitly OAuth?

source: read article
ru_ru: читать статью

source: You did not find an answer?
ru_ru: Вы не нашли ответа?

source: Then you should visit the %ssupport page%s of the plugin on %swordpress.org%s or in the %sofficial wiki page%s of the plugin hosted on %sgithub.com%s.
ru_ru: Вы можете посетить страницу %sподдерки%s плагина на %swordpress.org%s или %sОфициальный Вики%s плагина, размещенного на %sgithub.com%s.

source: Add
ru_ru: Добавить

source: Add new Campaign Source
ru_ru: Добавить новый источник кампании

source: The Campaign Source will be formatted once submitted.
ru_ru: Источник кампании будет отформатирован после отправки.

source: Add new Campaign Medium
ru_ru: Добавить новый канал кампании

source: The Campaign Medium will be formatted once submitted.
ru_ru: Канал кампании будет отформатировано после отправки.

source: Remove
ru_ru: Удалить

source: Remove Campaign Source
ru_ru: Удалить источник кампании

source: Select
ru_ru: Выбрать

source: Remove Campaign Medium
ru_ru: Удалить канал кампании

source: Remove option available only for Administrator
ru_ru: Опция удаления доступна только для администратора

source: Added translation to Spanish and Portuguese, big Thank you for %sTihh Gonçalves%s
ru_ru: Добавлен перевод на испанский и португальский языки, большая благодарность за перевод %sTihh Gonçalves%s

source: Fix Security Vulnerability - Missing Validation
ru_ru: Исправить уязвимость безопасности - (отсутствует проверка)

source: Added Security Nonces for all POST requests
ru_ru: Добавлены одноразовые номера безопасности для всех запросов POST

source: Initial Frontend shortcodes
ru_ru: Добавлена поддержка шорткодов

source: Minor changes
ru_ru: Мелкие исправления

source: Added autocomplete function for link suggestion
ru_ru: Добавлена функция автозаполнения для ссылки

source: Added pagination for links table
ru_ru: Добавлена пагинация для таблиц ссылок

source: Added Export UTM lins list to CSV file
ru_ru: Добавлен экспорт списока UTM ссылок в файл CSV

source: Fixed backend error for empty Bit.ly respond
ru_ru: Исправлена ошибка в бэкэнде для пустого ответа Bit.ly

source: Compatibility with WordPress 5.0 and Gutenberg Editor
ru_ru: Совместимость с WordPress 5.0 и редактором Гутенберга

source: Fixed not working notification
ru_ru: Исправлено не работающие уведомления

source: Update AJAX-function for link creation
ru_ru: Обновление AJAX-функции для создания ссылок

source: Added notification about created link on page/post editor
ru_ru: Добавлено уведомление о созданной ссылке в редакторе страниц / постов

source: Fixed not working button preview post
ru_ru: Исправлена не работающая кнопка предварительного просмотра поста

source: Fixed bug with plugin removal function
ru_ru: Исправлена ошибка с функцией удаления плагина

source: Minor bug fixes
ru_ru: Мелкие исправления

source: Improve language translation
ru_ru: Улучшение перевода

source: Include new API endpoint Bitly
ru_ru: Добавлен новый сервис сокращения ссылок Bitly

source: Switch to Bitly endpoint by default
ru_ru: Установлен Bitly сервис коротких ссылок по умолчанию

source: Migrate to ES6
ru_ru: Миграция к ES6

source: Implement fingerprints for assets
ru_ru: Внедрили отпечатки для статических фалов плагина

source: Improve code
ru_ru: Улучшен код

source: Fixed error with wrong variable on plugins page
ru_ru: Исправлена ошибка с ошибочной переменной на странице плагинов

source: Update missing translation strings
ru_ru: Обновление отсутствующих строк перевода

source: Update layout
ru_ru: Обновлён макет

source: Move "create a new tracking link" to own tab
ru_ru: «Создать новую ссылку» перемещенно в собственную вкладку

source: Added new advanced settings
ru_ru: Добавлены новые дополнительные настройки

source: Make plugin translatable
ru_ru: Плагин обновлен и сделан переводимым на другие языки

source: Added translation to Russian
ru_ru: Добавлен перевод на русский язык

source: Added meta box: with links list
ru_ru: Добавлен мета-бокс: со списком ссылок

source: Added meta box: Link generator (beta option)
ru_ru: Добавлен мета-бокс: генератор ссылок (бета)

source: Fix problem with global date_format override
ru_ru: Исправлена проблема с глобальным переопределением date_format

source: Add remove link function
ru_ru: Добавлена функция удаления ссылки

source: Add example link
ru_ru: Добавлен пример ссылки

source: Update pattern for url source
ru_ru: Обновлён шаблон для источника URL

source: Bug fixing
ru_ru: Исправление ошибок

source: Refactor code
ru_ru: Рефакторинг кода

source: Add advanced settings
ru_ru: Добавлены дополнительные настройки

source: Input/Output - sanitize, validate, and escape
ru_ru: Вход/выход - валидация и проверка данных

source: Update plugin name
ru_ru: Обновлено имя плагина

source: First live release
ru_ru: Первый релиз

source: About Campaign URL Builder
ru_ru: О плагине Campaign URL Builder

source: This plugin allows you to easily add campaign parameters to URLs so you can track Custom Campaigns in Google Analytics. Also, you can easily create short links and easily share it on social networks.
ru_ru: Этот плагин позволяет легко добавлять параметры ГЕЬ кампаний в URL-адреса, чтобы вы могли отслеживать пользовательские кампании в Google Analytics. Также вы можете легко создавать короткие ссылки и легко делиться ими в социальных сетях.

source: Changelog
ru_ru: Журнал изменений

source: Debug info
ru_ru: Отладочная информация

source: Coming soon...
ru_ru: Скоро...

source: Developed by
ru_ru: Разработано

source: Software Engineer
ru_ru: Инженер-программист

source: Homepage
ru_ru: Домашняя страница

source: Create a tracking link
ru_ru: Создать ссылку отслеживания

source: Generates links for Analytics tools and short link. Enter your Campaign Name, Source, Medium (UTM link) to generate a full link and a short link (trough the Google URL Shortener API) all in once
ru_ru: Создает ссылки для инструментов Google Analytics и короткой ссылки для социальных сетей. Введите название кампании, источник, канал (ссылка UTM), чтобы создать полную ссылку и короткую ссылку (через API-интерфейс сокращения URL-адресов Google)

source: https://alex.zappa.dev
ru_ru: https://alex.zappa.dev/ru
